import QuestionAbsenceCard from "@/components/daralfata/questionAbsenceCard";
import SectionBanner from "@/components/general/sectionBanner";
import { LucidePrinter, Printer, PrinterCheck } from "lucide-react";

export default function BaniInfo() {
  return (
    <div className="max-w-[1920px] mx-auto  bg-white font-[Jameel Noori Nastaleeq] text-right">
      <SectionBanner />

      <div className="p-6">
        {/* Header */}
        <div className="flex justify-end gap-10 items-center text-2xl text-primary mb-2 p-6">
          <button className="flex items-center gap-2">
            <LucidePrinter />
            <span>پرنٹ</span>
          </button>
          <span>تاریخ: 2024-02-25</span>
        </div>

        {/* Question Title */}
        <h1 className="text-3xl text-primary leading-relaxed border-b  place-self-end  mb-4 p-6 ">
          ایک شخص روزے کی حالت میں (واضح طور پر) اپنی بیوی سے شرمگاہ کے اندرونی
          حصے میں انگلی داخل کرے تو کیا روزہ ٹوٹ جائے گا؟
        </h1>

        {/* Question Box */}
        <div className="mb-6">
          <p className="leading-loose text-gray-800 lg:text-5xl">
            ’ ماہنامہ ’’صدق‘‘ لکھنؤکے شمارہ نمبر:۳۳ ،صفحہ نمبر:۲ پر ’’لولاک
            لماخلقت الأفلاک‘‘کی روایت پر وضع حدیث کا حکم لگایا گیا تھا، محدث
            العصر حضرت علامہ سید محمد یوسف بنوری  رحمۃ اللہ علیہ  نے اس پر
            ’’استدراک‘‘ کرتے ہوئے مذکورہ روایت کی حدیثی واسنادی حیثیت پر کلام
            فرمایا تھا، جو آج سے تقریباً پچھتر سال قبل (۱۹۴۰ء کے لگ بھگ) ماہنامہ
            ’’صدق‘‘ لکھنؤ میں شائع ہوا تھا، مضمون کی افادیت کے پیش نظر ماہنامہ
            ’’بینات‘‘ میں قندِ مکرر کے طور پر پیش خدمت ہے۔
          </p>
        </div>

        {/* Answer Box */}
        <div className="mb-6">
          <div className="w-fit place-self-end bg-primary text-white text-4xl px-8 py-3  rounded-2xl  my-8">
            جواب
          </div>
          <p className="leading-loose   text-5xl">
            ابھی یاد آیا کہ ماہ رمضان کے کسی پرچہ میں حدیث’’لولاک لما خلقت
            الأفلاک‘‘پر کسی سائل نے ’’اتفاقی موضوع ہونے‘‘ کا حکم لگایا تھا۔
            اسنادی حیثیت سے قطع نظر کرکے آپ نے جو توجیہ فرمائی تھی وہ پسند آئی
            تھی۔ اُس وقت خیال آیاکہ حدیث مذکور کے متعلق کچھ عرض کیا جائے، لیکن
            یاد نہیں رہا۔ آج یاد آنے پر اجمالاً اتنا عرض کیے دیتا ہوں کہ بالکل
            یک طرفہ فیصلہ نہ ہو اور کسی قدر اسنادی اعتبار سے بھی حقیقت سامنے رہے
            :     ۱:… ’’لو لاک لما خلقت الأفلاک‘‘کے لفظ سے تو حدیث نہیں ہے ،
            البتہ اس کے ہم معنی الفاظ سے کتب حدیث میں موجو دہے :   
             الف:…(مستدرک حاکم،ج:۲،ص:۶۱۵) میں ابن عباس  رضی اللہ عنہا  کی روایت
            ہے : ’’قال:أوحی اللّٰہ إلی عیسٰی علیہ السلام: یا عیسٰی! آمن بمحمد
            وامر من أدرکتہٗ من أمتک أن یومنوا بہ فلولا محمد ماخلقت آدم ولولا
            محمد ماخلقت الجنۃ ولا النار۔‘‘     ’’حاکم ابو عبد اللہ رحمۃ اللہ
            علیہ  روایت کرنے کے بعد فرماتے ہیں:’’ہٰذا حدیث صحیح الإسناد ولم
            یخرجاہ‘‘ حافظ ذہبی رحمۃ اللہ علیہ  اگرچہ فرماتے ہیں:’’أظنہٗ موضوعاً
            علی سعیدٍ‘‘لیکن کوئی وجہ اپنے گمان کی تائید میں بیان نہیں فرماسکے
            ۔      حافظ تقی الدین سبکی رحمۃ اللہ علیہ  اپنی کتاب ’’شفاء السقام‘‘
            میں اور شیخ سراج الدین بلقینی رحمۃ اللہ علیہ  اپنے فتاویٰ میں حافظ
            ابوعبد اللہ حاکم رحمۃ اللہ علیہ  کی تائید میں اس کی تصحیح فرماتے
            ہیں: ’’ومثلہٗ لایقال رأیا فحکمہ الرفع۔‘‘     ب:…(نیز مستدرک حاکم
            ،ج:۲، ص:۶۱۵)میں اور ’’مجمع الزوائد، ج:۸، ص:۲۵۳ میں بحوالہ طبرانی
            حضرت عمر فاروق  رضی اللہ عنہ  کا ایک طویل اثر ہے جس میں حضرت آدم 
            علیہ السلام کو یوں خطاب ہوا ہے:’’ولولا محمد ما خلقتُک۔‘‘ حاکمؒ نے اس
            کی بھی تصحیح فرمائی ہے۔ اس میں عبدالرحمن بن زید بن اسلم راوی ضعیف
            ہے، موضوع ہونے کا حکم پھر بھی مشکل ہے۔ عبد الرحمن بن زید‘ ترمذی ،
            ابن ماجہ کے رجال سے ہے ۔     ج:…حضرت علی  رضی اللہ عنہ  کا ایک اثر’’
            زرقانی شرح مواہب ‘‘میں ہے: ’’إن اللّٰہ قال لنبیہٖ:من أجلک  أسطح
            البطحاء وأموج الموج وأرفع السماء وأجعل الثواب والعقاب۔‘‘     ۲:…
            ان وجوہ کی بنا پر حدیث مذکور پر یہ حکم لگانا کہ موضوعی ہے اور اتفاقی
            موضوعی ہے ، کیوں کر صحیح ہے؟! ، بیہقی  رحمۃ اللہ علیہ ، ابوالشیخ
            اصبہانی رحمۃ اللہ علیہ  وغیرہ نے بھی پہلی حدیث کی روایت کی ہے ۔    
             غرض حدیثی اور اسنادی اعتبار سے مطلقًا موضوعی کا حکم نہایت مشکل ہے،
            خصوصًا اتفاقی موضوعی کا حکم ۔ بہر حال یہ دونوں دعوے تحقیق و واقعیت
            کے خلاف ہیں۔ مزید بحث و تحقیق کے بعد ابھی بہت کچھ لکھا جاسکتا ہے، اس
            وقت صرف اجمال ہی عرض کرنا مقصود تھا ۔     ۳:…عقلی حیثیت سے تو حدیث
            مذکور کی تصحیح و تائید میں بہت کچھ لکھنے کی گنجائش ہے، جس کی اس وقت
            حاجت نہیں۔ محدثین کی کتابوں میں کتنی حدیثیں ملتی ہیں کہ اسنادی
            اعتبار سے یا کسی خاص لفظ کے اعتبار سے یا مرفوع ہونے کے اعتبار سے
            ضعیف و ساقط ہوتی ہیں، لیکن معنوی حیثیت سے اور دوسری جہات سے وہ صحیح
            ہوتی ہیں جس کی تحقیق و تفصیل کا یہ موقع نہیں۔ والسلام 
          </p>
        </div>

        {/* Fatwa ID and Footer */}
        <div className="border-t py-10 border-gray-300  text-2xl text-primary mb-6 flex justify-between">
          <span>واللہ اعلم بالصواب۔ دارالافتاء، دارالسلام</span>
          <span>فتویٰ نمبر: 144512100003</span>
        </div>

        <div className="max-w-4xl mx-auto py-20 ">
          <QuestionAbsenceCard />
        </div>
      </div>
    </div>
  );
}
